Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
#define U2GTC U2GTC
extern volatile unsigned int  U2GTC __attribute__((__sfr__));
__extension__ typedef struct tagU2GTCBITS {
  union {
    struct {
      unsigned GTC:9;
    };
    struct {
      unsigned GTC0:1;
      unsigned GTC1:1;
      unsigned GTC2:1;
      unsigned GTC3:1;
      unsigned GTC4:1;
      unsigned GTC5:1;
      unsigned GTC6:1;
      unsigned GTC7:1;
      unsigned GTC8:1;
    };
  };
} U2GTCBITS;
extern volatile U2GTCBITS U2GTCbits __attribute__((__sfr__));

#define U2WTCL U2WTCL
extern volatile unsigned int  U2WTCL __attribute__((__sfr__));
__extension__ typedef struct tagU2WTCLBITS {
  union {
    struct {
      unsigned WTCL:16;
    };
    struct {
      unsigned WTC0:1;
      unsigned WTC1:1;
      unsigned WTC2:1;
      unsigned WTC3:1;
      unsigned WTC4:1;
      unsigned WTC5:1;
      unsigned WTC6:1;
      unsigned WTC7:1;
      unsigned WTC8:1;
      unsigned WTC9:1;
      unsigned WTC10:1;
      unsigned WTC11:1;
      unsigned WTC12:1;
      unsigned WTC13:1;
      unsigned WTC14:1;
      unsigned WTC15:1;
    };
  };
} U2WTCLBITS;
extern volatile U2WTCLBITS U2WTCLbits __attribute__((__sfr__));

#define U2WTCH U2WTCH
extern volatile unsigned int  U2WTCH __attribute__((__sfr__));
__extension__ typedef struct tagU2WTCHBITS {
  union {
    struct {
      unsigned WTCH:8;
    };
    struct {
      unsigned WTC16:1;
      unsigned WTC17:1;
      unsigned WTC18:1;
      unsigned WTC19:1;
      unsigned WTC20:1;
      unsigned WTC21:1;
      unsigned WTC22:1;
      unsigned WTC23:1;
    };
  };
} U2WTCHBITS;
extern volatile U2WTCHBITS U2WTCHbits __attribute__((__sfr__));

#define U3MODE U3MODE
extern volatile unsigned int  U3MODE __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEBITS {
  union {
    struct {
      unsigned STSEL:1;
      unsigned PDSEL:2;
      unsigned BRGH:1;
      unsigned URXINV:1;
      unsigned ABAUD:1;
      unsigned LPBACK:1;
      unsigned WAKE:1;
      unsigned UEN:2;
      unsigned :1;
      unsigned RTSMD:1;
      unsigned IREN:1;
      unsigned USIDL:1;
      unsigned :1;
      unsigned UARTEN:1;
    };
    struct {
      unsigned :1;
      unsigned PDSEL0:1;
      unsigned PDSEL1:1;
      unsigned :1;
      unsigned RXINV:1;
      unsigned :3;
      unsigned UEN0:1;
      unsigned UEN1:1;
    };
  };
} U3MODEBITS;
extern volatile U3MODEBITS U3MODEbits __attribute__((__sfr__));

#define U3STA U3STA
extern volatile unsigned int  U3STA __attribute__((__sfr__));
__extension__ typedef struct tagU3STABITS {
  union {
    struct {
      unsigned URXDA:1;
      unsigned OERR:1;
      unsigned FERR:1;
      unsigned PERR:1;
      unsigned RIDLE:1;
      unsigned ADDEN:1;
      unsigned URXISEL:2;
      unsigned TRMT:1;
      unsigned UTXBF:1;
      unsigned UTXEN:1;
      unsigned UTXBRK:1;
      unsigned URXEN:1;
      unsigned UTXISEL0:1;
      unsigned UTXINV:1;
      unsigned UTXISEL1:1;
    };
    struct {
      unsigned :6;
      unsigned URXISEL0:1;
      unsigned URXISEL1:1;
    };
  };
} U3STABITS;
extern volatile U3STABITS U3STAbits __attribute__((__sfr__));

#define U3TXREG U3TXREG
extern volatile unsigned int  U3TXREG __attribute__((__sfr__));
typedef struct tagU3TXREGBITS {
  unsigned :15;
  unsigned LAST:1;
} U3TXREGBITS;
extern volatile U3TXREGBITS U3TXREGbits __attribute__((__sfr__));

#define U3RXREG U3RXREG
extern volatile unsigned int  U3RXREG __attribute__((__sfr__));
#define U3BRG U3BRG
extern volatile unsigned int  U3BRG __attribute__((__sfr__));
#define U3ADMD U3ADMD
extern volatile unsigned int  U3ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU3ADMDBITS {
  union {
    struct {
      unsigned ADMADDR:8;
      unsigned ADMMASK:8;
    };
    struct {
      unsigned ADMADDR0:1;
      unsigned ADMADDR1:1;
      unsigned ADMADDR2:1;
      unsigned ADMADDR3:1;
      unsigned ADMADDR4:1;
      unsigned ADMADDR5:1;
      unsigned ADMADDR6:1;
      unsigned ADMADDR7:1;
      unsigned ADMMASK0:1;
      unsigned ADMMASK1:1;
      unsigned ADMMASK2:1;
      unsigned ADMMASK3:1;
      unsigned ADMMASK4:1;
      unsigned ADMMASK5:1;
      unsigned ADMMASK6:1;
      unsigned ADMMASK7:1;
    };
  };
} U3ADMDBITS;
extern volatile U3ADMDBITS U3ADMDbits __attribute__((__sfr__));

#define U4MODE U4MODE
extern volatile unsigned int  U4MODE __attribute__((__sfr__));
__extension__ typedef struct tagU4MODEBITS {
  union {
    struct {
      unsigned STSEL:1;
      unsigned PDSEL:2;
      unsigned BRGH:1;
      unsigned URXINV:1;
      unsigned ABAUD:1;
      unsigned LPBACK:1;
      unsigned WAKE:1;
      unsigned UEN:2;
      unsigned :1;
      unsigned RTSMD:1;
      unsigned IREN:1;
      unsigned USIDL:1;
      unsigned :1;
      unsigned UARTEN:1;
    };
    struct {
      unsigned :1;
      unsigned PDSEL0:1;
      unsigned PDSEL1:1;
      unsigned :1;
      unsigned RXINV:1;
      unsigned :3;
      unsigned UEN0:1;
      unsigned UEN1:1;
    };
  };
} U4MODEBITS;
extern volatile U4MODEBITS U4MODEbits __attribute__((__sfr__));

#define U4STA U4STA
extern volatile unsigned int  U4STA __attribute__((__sfr__));
__extension__ typedef struct tagU4STABITS {
  union {
    struct {
      unsigned URXDA:1;
      unsigned OERR:1;
      unsigned FERR:1;
      unsigned PERR:1;
      unsigned RIDLE:1;
      unsigned ADDEN:1;
      unsigned URXISEL:2;
      unsigned TRMT:1;
      unsigned UTXBF:1;
      unsigned UTXEN:1;
      unsigned UTXBRK:1;
      unsigned URXEN:1;
      unsigned UTXISEL0:1;
      unsigned UTXINV:1;
      unsigned UTXISEL1:1;
    };
    struct {
      unsigned :6;
      unsigned URXISEL0:1;
      unsigned URXISEL1:1;
    };
  };
} U4STABITS;
extern volatile U4STABITS U4STAbits __attribute__((__sfr__));

#define U4TXREG U4TXREG
extern volatile unsigned int  U4TXREG __attribute__((__sfr__));
typedef struct tagU4TXREGBITS {
  unsigned :15;
  unsigned LAST:1;
} U4TXREGBITS;
extern volatile U4TXREGBITS U4TXREGbits __attribute__((__sfr__));

#define U4RXREG U4RXREG
extern volatile unsigned int  U4RXREG __attribute__((__sfr__));
#define U4BRG U4BRG
extern volatile unsigned int  U4BRG __attribute__((__sfr__));
#define U4ADMD U4ADMD
extern volatile unsigned int  U4ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU4ADMDBITS {
  union {
    struct {
      unsigned ADMADDR:8;
      unsigned ADMMASK:8;
    };
    struct {
      unsigned ADMADDR0:1;
      unsigned ADMADDR1:1;
      unsigned ADMADDR2:1;
      unsigned ADMADDR3:1;
      unsigned ADMADDR4:1;
      unsigned ADMADDR5:1;
      unsigned ADMADDR6:1;
      unsigned ADMADDR7:1;
      unsigned ADMMASK0:1;
      unsigned ADMMASK1:1;
      unsigned ADMMASK2:1;
      unsigned ADMMASK3:1;
      unsigned ADMMASK4:1;
      unsigned ADMMASK5:1;
      unsigned ADMMASK6:1;
      unsigned ADMMASK7:1;
    };
  };
} U4ADMDBITS;
