Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
/* SPI3CON1H */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

/* SPI3CON2 */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

/* SPI3CON2L */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI3CON3 */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI3STATL */
/* Bitname _SPIRBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROV cannot be defined because it is used by more than one SFR */
/* Bitname _SRMT cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUR cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */

/* SPI3STATH */
/* Bitname _TXELM cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM5 cannot be defined because it is used by more than one SFR */

/* SPI3BUFL */
#define _SPI3BUFL SPI3BUFLbits.SPI3BUFL
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI3BUFH */
#define _SPI3BUFH SPI3BUFHbits.SPI3BUFH
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI3BRGL */
#define _SPI3BRGL SPI3BRGLbits.SPI3BRGL
/* Bitname _BRG cannot be defined because it is used by more than one SFR */

/* SPI3IMSK1 */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI3IMSKL */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI3IMSK2 */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI3IMSKH */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI3URDTL */
#define _SPI3URDTL SPI3URDTLbits.SPI3URDTL
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI3URDTH */
#define _SPI3URDTH SPI3URDTHbits.SPI3URDTH
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* RPINR0 */
#define _OCTRIG1R RPINR0bits.OCTRIG1R
#define _INT1R RPINR0bits.INT1R
#define _OCTRIG1R0 RPINR0bits.OCTRIG1R0
#define _OCTRIG1R1 RPINR0bits.OCTRIG1R1
#define _OCTRIG1R2 RPINR0bits.OCTRIG1R2
#define _OCTRIG1R3 RPINR0bits.OCTRIG1R3
#define _OCTRIG1R4 RPINR0bits.OCTRIG1R4
#define _OCTRIG1R5 RPINR0bits.OCTRIG1R5
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT3R RPINR1bits.INT3R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT3R0 RPINR1bits.INT3R0
#define _INT3R1 RPINR1bits.INT3R1
#define _INT3R2 RPINR1bits.INT3R2
#define _INT3R3 RPINR1bits.INT3R3
#define _INT3R4 RPINR1bits.INT3R4
#define _INT3R5 RPINR1bits.INT3R5

/* RPINR2 */
#define _INT4R RPINR2bits.INT4R
#define _OCTRIG2R RPINR2bits.OCTRIG2R
#define _INT4R0 RPINR2bits.INT4R0
#define _INT4R1 RPINR2bits.INT4R1
#define _INT4R2 RPINR2bits.INT4R2
#define _INT4R3 RPINR2bits.INT4R3
#define _INT4R4 RPINR2bits.INT4R4
#define _INT4R5 RPINR2bits.INT4R5
#define _OCTRIG2R0 RPINR2bits.OCTRIG2R0
#define _OCTRIG2R1 RPINR2bits.OCTRIG2R1
#define _OCTRIG2R2 RPINR2bits.OCTRIG2R2
#define _OCTRIG2R3 RPINR2bits.OCTRIG2R3
#define _OCTRIG2R4 RPINR2bits.OCTRIG2R4
#define _OCTRIG2R5 RPINR2bits.OCTRIG2R5

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5
#define _IC2R0 RPINR7bits.IC2R0
#define _IC2R1 RPINR7bits.IC2R1
#define _IC2R2 RPINR7bits.IC2R2
#define _IC2R3 RPINR7bits.IC2R3
#define _IC2R4 RPINR7bits.IC2R4
#define _IC2R5 RPINR7bits.IC2R5

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R
#define _IC3R0 RPINR8bits.IC3R0
#define _IC3R1 RPINR8bits.IC3R1
#define _IC3R2 RPINR8bits.IC3R2
#define _IC3R3 RPINR8bits.IC3R3
#define _IC3R4 RPINR8bits.IC3R4
#define _IC3R5 RPINR8bits.IC3R5
#define _IC4R0 RPINR8bits.IC4R0
#define _IC4R1 RPINR8bits.IC4R1
#define _IC4R2 RPINR8bits.IC4R2
#define _IC4R3 RPINR8bits.IC4R3
#define _IC4R4 RPINR8bits.IC4R4
#define _IC4R5 RPINR8bits.IC4R5

