Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
#define _ANSB_ANSB9_POSITION                     0x00000009
#define _ANSB_ANSB9_MASK                         0x00000200
#define _ANSB_ANSB9_LENGTH                       0x00000001

#define _ANSB_ANSB13_POSITION                    0x0000000D
#define _ANSB_ANSB13_MASK                        0x00002000
#define _ANSB_ANSB13_LENGTH                      0x00000001

#define _ANSB_ANSB14_POSITION                    0x0000000E
#define _ANSB_ANSB14_MASK                        0x00004000
#define _ANSB_ANSB14_LENGTH                      0x00000001

#define _ANSB_ANSB15_POSITION                    0x0000000F
#define _ANSB_ANSB15_MASK                        0x00008000
#define _ANSB_ANSB15_LENGTH                      0x00000001

#define _ANCFG_VBGEN_POSITION                    0x00000000
#define _ANCFG_VBGEN_MASK                        0x00000001
#define _ANCFG_VBGEN_LENGTH                      0x00000001

#define _ANCFG_VBG2EN_POSITION                   0x00000001
#define _ANCFG_VBG2EN_MASK                       0x00000002
#define _ANCFG_VBG2EN_LENGTH                     0x00000001

#define _CRYCON1_CPHRMOD_POSITION                0x00000000
#define _CRYCON1_CPHRMOD_MASK                    0x00000007
#define _CRYCON1_CPHRMOD_LENGTH                  0x00000003

#define _CRYCON1_CPHRSEL_POSITION                0x00000003
#define _CRYCON1_CPHRSEL_MASK                    0x00000008
#define _CRYCON1_CPHRSEL_LENGTH                  0x00000001

#define _CRYCON1_OPMOD_POSITION                  0x00000004
#define _CRYCON1_OPMOD_MASK                      0x000000F0
#define _CRYCON1_OPMOD_LENGTH                    0x00000004

#define _CRYCON1_CRYGO_POSITION                  0x00000008
#define _CRYCON1_CRYGO_MASK                      0x00000100
#define _CRYCON1_CRYGO_LENGTH                    0x00000001

#define _CRYCON1_FREEIE_POSITION                 0x0000000A
#define _CRYCON1_FREEIE_MASK                     0x00000400
#define _CRYCON1_FREEIE_LENGTH                   0x00000001

#define _CRYCON1_DONEIE_POSITION                 0x0000000B
#define _CRYCON1_DONEIE_MASK                     0x00000800
#define _CRYCON1_DONEIE_LENGTH                   0x00000001

#define _CRYCON1_ROLLIE_POSITION                 0x0000000C
#define _CRYCON1_ROLLIE_MASK                     0x00001000
#define _CRYCON1_ROLLIE_LENGTH                   0x00000001

#define _CRYCON1_CRYSIDL_POSITION                0x0000000D
#define _CRYCON1_CRYSIDL_MASK                    0x00002000
#define _CRYCON1_CRYSIDL_LENGTH                  0x00000001

#define _CRYCON1_CRYON_POSITION                  0x0000000F
#define _CRYCON1_CRYON_MASK                      0x00008000
#define _CRYCON1_CRYON_LENGTH                    0x00000001

#define _CRYCON1_CPHRMOD0_POSITION               0x00000000
#define _CRYCON1_CPHRMOD0_MASK                   0x00000001
#define _CRYCON1_CPHRMOD0_LENGTH                 0x00000001

#define _CRYCON1_CPHRMOD1_POSITION               0x00000001
#define _CRYCON1_CPHRMOD1_MASK                   0x00000002
#define _CRYCON1_CPHRMOD1_LENGTH                 0x00000001

#define _CRYCON1_CPHRMOD2_POSITION               0x00000002
#define _CRYCON1_CPHRMOD2_MASK                   0x00000004
#define _CRYCON1_CPHRMOD2_LENGTH                 0x00000001

#define _CRYCON1_OPMOD0_POSITION                 0x00000004
#define _CRYCON1_OPMOD0_MASK                     0x00000010
#define _CRYCON1_OPMOD0_LENGTH                   0x00000001

#define _CRYCON1_OPMOD1_POSITION                 0x00000005
#define _CRYCON1_OPMOD1_MASK                     0x00000020
#define _CRYCON1_OPMOD1_LENGTH                   0x00000001

#define _CRYCON1_OPMOD2_POSITION                 0x00000006
#define _CRYCON1_OPMOD2_MASK                     0x00000040
#define _CRYCON1_OPMOD2_LENGTH                   0x00000001

#define _CRYCON1_OPMOD3_POSITION                 0x00000007
#define _CRYCON1_OPMOD3_MASK                     0x00000080
#define _CRYCON1_OPMOD3_LENGTH                   0x00000001

#define _CRYCONL_CPHRMOD_POSITION                0x00000000
#define _CRYCONL_CPHRMOD_MASK                    0x00000007
#define _CRYCONL_CPHRMOD_LENGTH                  0x00000003

#define _CRYCONL_CPHRSEL_POSITION                0x00000003
#define _CRYCONL_CPHRSEL_MASK                    0x00000008
#define _CRYCONL_CPHRSEL_LENGTH                  0x00000001

#define _CRYCONL_OPMOD_POSITION                  0x00000004
#define _CRYCONL_OPMOD_MASK                      0x000000F0
#define _CRYCONL_OPMOD_LENGTH                    0x00000004

#define _CRYCONL_CRYGO_POSITION                  0x00000008
#define _CRYCONL_CRYGO_MASK                      0x00000100
#define _CRYCONL_CRYGO_LENGTH                    0x00000001

#define _CRYCONL_FREEIE_POSITION                 0x0000000A
#define _CRYCONL_FREEIE_MASK                     0x00000400
#define _CRYCONL_FREEIE_LENGTH                   0x00000001

#define _CRYCONL_DONEIE_POSITION                 0x0000000B
#define _CRYCONL_DONEIE_MASK                     0x00000800
#define _CRYCONL_DONEIE_LENGTH                   0x00000001

#define _CRYCONL_ROLLIE_POSITION                 0x0000000C
#define _CRYCONL_ROLLIE_MASK                     0x00001000
#define _CRYCONL_ROLLIE_LENGTH                   0x00000001

#define _CRYCONL_CRYSIDL_POSITION                0x0000000D
#define _CRYCONL_CRYSIDL_MASK                    0x00002000
#define _CRYCONL_CRYSIDL_LENGTH                  0x00000001

#define _CRYCONL_CRYON_POSITION                  0x0000000F
#define _CRYCONL_CRYON_MASK                      0x00008000
#define _CRYCONL_CRYON_LENGTH                    0x00000001

#define _CRYCONL_CPHRMOD0_POSITION               0x00000000
#define _CRYCONL_CPHRMOD0_MASK                   0x00000001
#define _CRYCONL_CPHRMOD0_LENGTH                 0x00000001

#define _CRYCONL_CPHRMOD1_POSITION               0x00000001
#define _CRYCONL_CPHRMOD1_MASK                   0x00000002
#define _CRYCONL_CPHRMOD1_LENGTH                 0x00000001

#define _CRYCONL_CPHRMOD2_POSITION               0x00000002
#define _CRYCONL_CPHRMOD2_MASK                   0x00000004
#define _CRYCONL_CPHRMOD2_LENGTH                 0x00000001

#define _CRYCONL_OPMOD0_POSITION                 0x00000004
#define _CRYCONL_OPMOD0_MASK                     0x00000010
#define _CRYCONL_OPMOD0_LENGTH                   0x00000001

