Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
#define _U1ADDR_DEVADDR4_POSITION                0x00000004
#define _U1ADDR_DEVADDR4_MASK                    0x00000010
#define _U1ADDR_DEVADDR4_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR5_POSITION                0x00000005
#define _U1ADDR_DEVADDR5_MASK                    0x00000020
#define _U1ADDR_DEVADDR5_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR6_POSITION                0x00000006
#define _U1ADDR_DEVADDR6_MASK                    0x00000040
#define _U1ADDR_DEVADDR6_LENGTH                  0x00000001

#define _U1ADDR_LOWSPDEN_POSITION                0x00000007
#define _U1ADDR_LOWSPDEN_MASK                    0x00000080
#define _U1ADDR_LOWSPDEN_LENGTH                  0x00000001

#define _U1ADDR_ADDR0_POSITION                   0x00000000
#define _U1ADDR_ADDR0_MASK                       0x00000001
#define _U1ADDR_ADDR0_LENGTH                     0x00000001

#define _U1ADDR_ADDR1_POSITION                   0x00000001
#define _U1ADDR_ADDR1_MASK                       0x00000002
#define _U1ADDR_ADDR1_LENGTH                     0x00000001

#define _U1ADDR_ADDR2_POSITION                   0x00000002
#define _U1ADDR_ADDR2_MASK                       0x00000004
#define _U1ADDR_ADDR2_LENGTH                     0x00000001

#define _U1ADDR_ADDR3_POSITION                   0x00000003
#define _U1ADDR_ADDR3_MASK                       0x00000008
#define _U1ADDR_ADDR3_LENGTH                     0x00000001

#define _U1ADDR_ADDR4_POSITION                   0x00000004
#define _U1ADDR_ADDR4_MASK                       0x00000010
#define _U1ADDR_ADDR4_LENGTH                     0x00000001

#define _U1ADDR_ADDR5_POSITION                   0x00000005
#define _U1ADDR_ADDR5_MASK                       0x00000020
#define _U1ADDR_ADDR5_LENGTH                     0x00000001

#define _U1ADDR_ADDR6_POSITION                   0x00000006
#define _U1ADDR_ADDR6_MASK                       0x00000040
#define _U1ADDR_ADDR6_LENGTH                     0x00000001

#define _U1ADDR_DEVADDR_POSITION                 0x00000000
#define _U1ADDR_DEVADDR_MASK                     0x0000007F
#define _U1ADDR_DEVADDR_LENGTH                   0x00000007

#define _U1BDTP1_BDTPTRL_POSITION                0x00000001
#define _U1BDTP1_BDTPTRL_MASK                    0x000000FE
#define _U1BDTP1_BDTPTRL_LENGTH                  0x00000007

#define _U1BDTP1_BDTPTRL0_POSITION               0x00000001
#define _U1BDTP1_BDTPTRL0_MASK                   0x00000002
#define _U1BDTP1_BDTPTRL0_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL1_POSITION               0x00000002
#define _U1BDTP1_BDTPTRL1_MASK                   0x00000004
#define _U1BDTP1_BDTPTRL1_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL2_POSITION               0x00000003
#define _U1BDTP1_BDTPTRL2_MASK                   0x00000008
#define _U1BDTP1_BDTPTRL2_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL3_POSITION               0x00000004
#define _U1BDTP1_BDTPTRL3_MASK                   0x00000010
#define _U1BDTP1_BDTPTRL3_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL4_POSITION               0x00000005
#define _U1BDTP1_BDTPTRL4_MASK                   0x00000020
#define _U1BDTP1_BDTPTRL4_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL5_POSITION               0x00000006
#define _U1BDTP1_BDTPTRL5_MASK                   0x00000040
#define _U1BDTP1_BDTPTRL5_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL6_POSITION               0x00000007
#define _U1BDTP1_BDTPTRL6_MASK                   0x00000080
#define _U1BDTP1_BDTPTRL6_LENGTH                 0x00000001

#define _U1FRML_FRM0_POSITION                    0x00000000
#define _U1FRML_FRM0_MASK                        0x00000001
#define _U1FRML_FRM0_LENGTH                      0x00000001

#define _U1FRML_FRM1_POSITION                    0x00000001
#define _U1FRML_FRM1_MASK                        0x00000002
#define _U1FRML_FRM1_LENGTH                      0x00000001

#define _U1FRML_FRM2_POSITION                    0x00000002
#define _U1FRML_FRM2_MASK                        0x00000004
#define _U1FRML_FRM2_LENGTH                      0x00000001

#define _U1FRML_FRM3_POSITION                    0x00000003
#define _U1FRML_FRM3_MASK                        0x00000008
#define _U1FRML_FRM3_LENGTH                      0x00000001

#define _U1FRML_FRM4_POSITION                    0x00000004
#define _U1FRML_FRM4_MASK                        0x00000010
#define _U1FRML_FRM4_LENGTH                      0x00000001

#define _U1FRML_FRM5_POSITION                    0x00000005
#define _U1FRML_FRM5_MASK                        0x00000020
#define _U1FRML_FRM5_LENGTH                      0x00000001

#define _U1FRML_FRM6_POSITION                    0x00000006
#define _U1FRML_FRM6_MASK                        0x00000040
#define _U1FRML_FRM6_LENGTH                      0x00000001

#define _U1FRML_FRM7_POSITION                    0x00000007
#define _U1FRML_FRM7_MASK                        0x00000080
#define _U1FRML_FRM7_LENGTH                      0x00000001

#define _U1FRMH_FRM8_POSITION                    0x00000000
#define _U1FRMH_FRM8_MASK                        0x00000001
#define _U1FRMH_FRM8_LENGTH                      0x00000001

#define _U1FRMH_FRM9_POSITION                    0x00000001
#define _U1FRMH_FRM9_MASK                        0x00000002
#define _U1FRMH_FRM9_LENGTH                      0x00000001

#define _U1FRMH_FRM10_POSITION                   0x00000002
#define _U1FRMH_FRM10_MASK                       0x00000004
#define _U1FRMH_FRM10_LENGTH                     0x00000001

#define _U1TOK_EP_POSITION                       0x00000000
#define _U1TOK_EP_MASK                           0x0000000F
#define _U1TOK_EP_LENGTH                         0x00000004

#define _U1TOK_PID_POSITION                      0x00000004
#define _U1TOK_PID_MASK                          0x000000F0
#define _U1TOK_PID_LENGTH                        0x00000004

#define _U1TOK_EP0_POSITION                      0x00000000
#define _U1TOK_EP0_MASK                          0x00000001
#define _U1TOK_EP0_LENGTH                        0x00000001

#define _U1TOK_EP1_POSITION                      0x00000001
#define _U1TOK_EP1_MASK                          0x00000002
#define _U1TOK_EP1_LENGTH                        0x00000001

#define _U1TOK_EP2_POSITION                      0x00000002
#define _U1TOK_EP2_MASK                          0x00000004
#define _U1TOK_EP2_LENGTH                        0x00000001

#define _U1TOK_EP3_POSITION                      0x00000003
#define _U1TOK_EP3_MASK                          0x00000008
#define _U1TOK_EP3_LENGTH                        0x00000001

#define _U1TOK_PID0_POSITION                     0x00000004
#define _U1TOK_PID0_MASK                         0x00000010
#define _U1TOK_PID0_LENGTH                       0x00000001

#define _U1TOK_PID1_POSITION                     0x00000005
#define _U1TOK_PID1_MASK                         0x00000020
#define _U1TOK_PID1_LENGTH                       0x00000001

#define _U1TOK_PID2_POSITION                     0x00000006
#define _U1TOK_PID2_MASK                         0x00000040
#define _U1TOK_PID2_LENGTH                       0x00000001

#define _U1TOK_PID3_POSITION                     0x00000007
#define _U1TOK_PID3_MASK                         0x00000080
#define _U1TOK_PID3_LENGTH                       0x00000001

#define _U1SOF_CNT_POSITION                      0x00000000
#define _U1SOF_CNT_MASK                          0x000000FF
#define _U1SOF_CNT_LENGTH                        0x00000008

#define _U1SOF_CNT0_POSITION                     0x00000000
#define _U1SOF_CNT0_MASK                         0x00000001
#define _U1SOF_CNT0_LENGTH                       0x00000001

