Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
#define _U1SOF_CNT1_POSITION                     0x00000001
#define _U1SOF_CNT1_MASK                         0x00000002
#define _U1SOF_CNT1_LENGTH                       0x00000001

#define _U1SOF_CNT2_POSITION                     0x00000002
#define _U1SOF_CNT2_MASK                         0x00000004
#define _U1SOF_CNT2_LENGTH                       0x00000001

#define _U1SOF_CNT3_POSITION                     0x00000003
#define _U1SOF_CNT3_MASK                         0x00000008
#define _U1SOF_CNT3_LENGTH                       0x00000001

#define _U1SOF_CNT4_POSITION                     0x00000004
#define _U1SOF_CNT4_MASK                         0x00000010
#define _U1SOF_CNT4_LENGTH                       0x00000001

#define _U1SOF_CNT5_POSITION                     0x00000005
#define _U1SOF_CNT5_MASK                         0x00000020
#define _U1SOF_CNT5_LENGTH                       0x00000001

#define _U1SOF_CNT6_POSITION                     0x00000006
#define _U1SOF_CNT6_MASK                         0x00000040
#define _U1SOF_CNT6_LENGTH                       0x00000001

#define _U1SOF_CNT7_POSITION                     0x00000007
#define _U1SOF_CNT7_MASK                         0x00000080
#define _U1SOF_CNT7_LENGTH                       0x00000001

#define _U1BDTP2_BDTPTRH_POSITION                0x00000000
#define _U1BDTP2_BDTPTRH_MASK                    0x000000FF
#define _U1BDTP2_BDTPTRH_LENGTH                  0x00000008

#define _U1BDTP3_BDTPTRU_POSITION                0x00000000
#define _U1BDTP3_BDTPTRU_MASK                    0x000000FF
#define _U1BDTP3_BDTPTRU_LENGTH                  0x00000008

#define _U1CNFG1_PPB_POSITION                    0x00000000
#define _U1CNFG1_PPB_MASK                        0x00000003
#define _U1CNFG1_PPB_LENGTH                      0x00000002

#define _U1CNFG1_USBSIDL_POSITION                0x00000004
#define _U1CNFG1_USBSIDL_MASK                    0x00000010
#define _U1CNFG1_USBSIDL_LENGTH                  0x00000001

#define _U1CNFG1_UOEMON_POSITION                 0x00000006
#define _U1CNFG1_UOEMON_MASK                     0x00000040
#define _U1CNFG1_UOEMON_LENGTH                   0x00000001

#define _U1CNFG1_UTEYE_POSITION                  0x00000007
#define _U1CNFG1_UTEYE_MASK                      0x00000080
#define _U1CNFG1_UTEYE_LENGTH                    0x00000001

#define _U1CNFG1_PPB0_POSITION                   0x00000000
#define _U1CNFG1_PPB0_MASK                       0x00000001
#define _U1CNFG1_PPB0_LENGTH                     0x00000001

#define _U1CNFG1_PPB1_POSITION                   0x00000001
#define _U1CNFG1_PPB1_MASK                       0x00000002
#define _U1CNFG1_PPB1_LENGTH                     0x00000001

#define _U1CNFG2_UTRDIS_POSITION                 0x00000000
#define _U1CNFG2_UTRDIS_MASK                     0x00000001
#define _U1CNFG2_UTRDIS_LENGTH                   0x00000001

#define _U1CNFG2_UVBUSDIS_POSITION               0x00000002
#define _U1CNFG2_UVBUSDIS_MASK                   0x00000004
#define _U1CNFG2_UVBUSDIS_LENGTH                 0x00000001

#define _U1CNFG2_EXTI2CEN_POSITION               0x00000003
#define _U1CNFG2_EXTI2CEN_MASK                   0x00000008
#define _U1CNFG2_EXTI2CEN_LENGTH                 0x00000001

#define _U1CNFG2_PUVBUS_POSITION                 0x00000004
#define _U1CNFG2_PUVBUS_MASK                     0x00000010
#define _U1CNFG2_PUVBUS_LENGTH                   0x00000001

#define _U1EP0_EPHSHK_POSITION                   0x00000000
#define _U1EP0_EPHSHK_MASK                       0x00000001
#define _U1EP0_EPHSHK_LENGTH                     0x00000001

#define _U1EP0_EPSTALL_POSITION                  0x00000001
#define _U1EP0_EPSTALL_MASK                      0x00000002
#define _U1EP0_EPSTALL_LENGTH                    0x00000001

#define _U1EP0_EPTXEN_POSITION                   0x00000002
#define _U1EP0_EPTXEN_MASK                       0x00000004
#define _U1EP0_EPTXEN_LENGTH                     0x00000001

#define _U1EP0_EPRXEN_POSITION                   0x00000003
#define _U1EP0_EPRXEN_MASK                       0x00000008
#define _U1EP0_EPRXEN_LENGTH                     0x00000001

#define _U1EP0_EPCONDIS_POSITION                 0x00000004
#define _U1EP0_EPCONDIS_MASK                     0x00000010
#define _U1EP0_EPCONDIS_LENGTH                   0x00000001

#define _U1EP0_RETRYDIS_POSITION                 0x00000006
#define _U1EP0_RETRYDIS_MASK                     0x00000040
#define _U1EP0_RETRYDIS_LENGTH                   0x00000001

#define _U1EP0_LSPD_POSITION                     0x00000007
#define _U1EP0_LSPD_MASK                         0x00000080
#define _U1EP0_LSPD_LENGTH                       0x00000001

#define _U1EP0_EPINEN_POSITION                   0x00000002
#define _U1EP0_EPINEN_MASK                       0x00000004
#define _U1EP0_EPINEN_LENGTH                     0x00000001

#define _U1EP0_EPOUTEN_POSITION                  0x00000003
#define _U1EP0_EPOUTEN_MASK                      0x00000008
#define _U1EP0_EPOUTEN_LENGTH                    0x00000001

#define _U1EP0_LOWSPD_POSITION                   0x00000007
#define _U1EP0_LOWSPD_MASK                       0x00000080
#define _U1EP0_LOWSPD_LENGTH                     0x00000001

#define _U1EP1_EPHSHK_POSITION                   0x00000000
#define _U1EP1_EPHSHK_MASK                       0x00000001
#define _U1EP1_EPHSHK_LENGTH                     0x00000001

#define _U1EP1_EPSTALL_POSITION                  0x00000001
#define _U1EP1_EPSTALL_MASK                      0x00000002
#define _U1EP1_EPSTALL_LENGTH                    0x00000001

#define _U1EP1_EPTXEN_POSITION                   0x00000002
#define _U1EP1_EPTXEN_MASK                       0x00000004
#define _U1EP1_EPTXEN_LENGTH                     0x00000001

#define _U1EP1_EPRXEN_POSITION                   0x00000003
#define _U1EP1_EPRXEN_MASK                       0x00000008
#define _U1EP1_EPRXEN_LENGTH                     0x00000001

#define _U1EP1_EPCONDIS_POSITION                 0x00000004
#define _U1EP1_EPCONDIS_MASK                     0x00000010
#define _U1EP1_EPCONDIS_LENGTH                   0x00000001

#define _U1EP1_EPINEN_POSITION                   0x00000002
#define _U1EP1_EPINEN_MASK                       0x00000004
#define _U1EP1_EPINEN_LENGTH                     0x00000001

#define _U1EP1_EPOUTEN_POSITION                  0x00000003
#define _U1EP1_EPOUTEN_MASK                      0x00000008
#define _U1EP1_EPOUTEN_LENGTH                    0x00000001

#define _U1EP2_EPHSHK_POSITION                   0x00000000
#define _U1EP2_EPHSHK_MASK                       0x00000001
#define _U1EP2_EPHSHK_LENGTH                     0x00000001

#define _U1EP2_EPSTALL_POSITION                  0x00000001
#define _U1EP2_EPSTALL_MASK                      0x00000002
#define _U1EP2_EPSTALL_LENGTH                    0x00000001

#define _U1EP2_EPTXEN_POSITION                   0x00000002
#define _U1EP2_EPTXEN_MASK                       0x00000004
#define _U1EP2_EPTXEN_LENGTH                     0x00000001

#define _U1EP2_EPRXEN_POSITION                   0x00000003
#define _U1EP2_EPRXEN_MASK                       0x00000008
#define _U1EP2_EPRXEN_LENGTH                     0x00000001

#define _U1EP2_EPCONDIS_POSITION                 0x00000004
#define _U1EP2_EPCONDIS_MASK                     0x00000010
#define _U1EP2_EPCONDIS_LENGTH                   0x00000001

