Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
#define _U1EP13_EPCONDIS_POSITION                0x00000004
#define _U1EP13_EPCONDIS_MASK                    0x00000010
#define _U1EP13_EPCONDIS_LENGTH                  0x00000001

#define _U1EP13_EPINEN_POSITION                  0x00000002
#define _U1EP13_EPINEN_MASK                      0x00000004
#define _U1EP13_EPINEN_LENGTH                    0x00000001

#define _U1EP13_EPOUTEN_POSITION                 0x00000003
#define _U1EP13_EPOUTEN_MASK                     0x00000008
#define _U1EP13_EPOUTEN_LENGTH                   0x00000001

#define _U1EP14_EPHSHK_POSITION                  0x00000000
#define _U1EP14_EPHSHK_MASK                      0x00000001
#define _U1EP14_EPHSHK_LENGTH                    0x00000001

#define _U1EP14_EPSTALL_POSITION                 0x00000001
#define _U1EP14_EPSTALL_MASK                     0x00000002
#define _U1EP14_EPSTALL_LENGTH                   0x00000001

#define _U1EP14_EPTXEN_POSITION                  0x00000002
#define _U1EP14_EPTXEN_MASK                      0x00000004
#define _U1EP14_EPTXEN_LENGTH                    0x00000001

#define _U1EP14_EPRXEN_POSITION                  0x00000003
#define _U1EP14_EPRXEN_MASK                      0x00000008
#define _U1EP14_EPRXEN_LENGTH                    0x00000001

#define _U1EP14_EPCONDIS_POSITION                0x00000004
#define _U1EP14_EPCONDIS_MASK                    0x00000010
#define _U1EP14_EPCONDIS_LENGTH                  0x00000001

#define _U1EP14_EPINEN_POSITION                  0x00000002
#define _U1EP14_EPINEN_MASK                      0x00000004
#define _U1EP14_EPINEN_LENGTH                    0x00000001

#define _U1EP14_EPOUTEN_POSITION                 0x00000003
#define _U1EP14_EPOUTEN_MASK                     0x00000008
#define _U1EP14_EPOUTEN_LENGTH                   0x00000001

#define _U1EP15_EPHSHK_POSITION                  0x00000000
#define _U1EP15_EPHSHK_MASK                      0x00000001
#define _U1EP15_EPHSHK_LENGTH                    0x00000001

#define _U1EP15_EPSTALL_POSITION                 0x00000001
#define _U1EP15_EPSTALL_MASK                     0x00000002
#define _U1EP15_EPSTALL_LENGTH                   0x00000001

#define _U1EP15_EPTXEN_POSITION                  0x00000002
#define _U1EP15_EPTXEN_MASK                      0x00000004
#define _U1EP15_EPTXEN_LENGTH                    0x00000001

#define _U1EP15_EPRXEN_POSITION                  0x00000003
#define _U1EP15_EPRXEN_MASK                      0x00000008
#define _U1EP15_EPRXEN_LENGTH                    0x00000001

#define _U1EP15_EPCONDIS_POSITION                0x00000004
#define _U1EP15_EPCONDIS_MASK                    0x00000010
#define _U1EP15_EPCONDIS_LENGTH                  0x00000001

#define _U1EP15_EPINEN_POSITION                  0x00000002
#define _U1EP15_EPINEN_MASK                      0x00000004
#define _U1EP15_EPINEN_LENGTH                    0x00000001

#define _U1EP15_EPOUTEN_POSITION                 0x00000003
#define _U1EP15_EPOUTEN_MASK                     0x00000008
#define _U1EP15_EPOUTEN_LENGTH                   0x00000001

#define _DMACON_PRSSEL_POSITION                  0x00000000
#define _DMACON_PRSSEL_MASK                      0x00000001
#define _DMACON_PRSSEL_LENGTH                    0x00000001

#define _DMACON_DMAEN_POSITION                   0x0000000F
#define _DMACON_DMAEN_MASK                       0x00008000
#define _DMACON_DMAEN_LENGTH                     0x00000001

#define _DMACH0_CHEN_POSITION                    0x00000000
#define _DMACH0_CHEN_MASK                        0x00000001
#define _DMACH0_CHEN_LENGTH                      0x00000001

#define _DMACH0_SIZE_POSITION                    0x00000001
#define _DMACH0_SIZE_MASK                        0x00000002
#define _DMACH0_SIZE_LENGTH                      0x00000001

#define _DMACH0_TRMODE_POSITION                  0x00000002
#define _DMACH0_TRMODE_MASK                      0x0000000C
#define _DMACH0_TRMODE_LENGTH                    0x00000002

#define _DMACH0_DAMODE_POSITION                  0x00000004
#define _DMACH0_DAMODE_MASK                      0x00000030
#define _DMACH0_DAMODE_LENGTH                    0x00000002

#define _DMACH0_SAMODE_POSITION                  0x00000006
#define _DMACH0_SAMODE_MASK                      0x000000C0
#define _DMACH0_SAMODE_LENGTH                    0x00000002

#define _DMACH0_CHREQ_POSITION                   0x00000008
#define _DMACH0_CHREQ_MASK                       0x00000100
#define _DMACH0_CHREQ_LENGTH                     0x00000001

#define _DMACH0_RELOAD_POSITION                  0x00000009
#define _DMACH0_RELOAD_MASK                      0x00000200
#define _DMACH0_RELOAD_LENGTH                    0x00000001

#define _DMACH0_NULLW_POSITION                   0x0000000A
#define _DMACH0_NULLW_MASK                       0x00000400
#define _DMACH0_NULLW_LENGTH                     0x00000001

#define _DMACH0_TRMODE0_POSITION                 0x00000002
#define _DMACH0_TRMODE0_MASK                     0x00000004
#define _DMACH0_TRMODE0_LENGTH                   0x00000001

#define _DMACH0_TRMODE1_POSITION                 0x00000003
#define _DMACH0_TRMODE1_MASK                     0x00000008
#define _DMACH0_TRMODE1_LENGTH                   0x00000001

#define _DMACH0_DAMODE0_POSITION                 0x00000004
#define _DMACH0_DAMODE0_MASK                     0x00000010
#define _DMACH0_DAMODE0_LENGTH                   0x00000001

#define _DMACH0_DAMODE1_POSITION                 0x00000005
#define _DMACH0_DAMODE1_MASK                     0x00000020
#define _DMACH0_DAMODE1_LENGTH                   0x00000001

#define _DMACH0_SAMODE0_POSITION                 0x00000006
#define _DMACH0_SAMODE0_MASK                     0x00000040
#define _DMACH0_SAMODE0_LENGTH                   0x00000001

#define _DMACH0_SAMODE1_POSITION                 0x00000007
#define _DMACH0_SAMODE1_MASK                     0x00000080
#define _DMACH0_SAMODE1_LENGTH                   0x00000001

#define _DMAINT0_HALFEN_POSITION                 0x00000000
#define _DMAINT0_HALFEN_MASK                     0x00000001
#define _DMAINT0_HALFEN_LENGTH                   0x00000001

#define _DMAINT0_OVRUNIF_POSITION                0x00000003
#define _DMAINT0_OVRUNIF_MASK                    0x00000008
#define _DMAINT0_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT0_HALFIF_POSITION                 0x00000004
#define _DMAINT0_HALFIF_MASK                     0x00000010
#define _DMAINT0_HALFIF_LENGTH                   0x00000001

#define _DMAINT0_DONEIF_POSITION                 0x00000005
#define _DMAINT0_DONEIF_MASK                     0x00000020
#define _DMAINT0_DONEIF_LENGTH                   0x00000001

#define _DMAINT0_LOWIF_POSITION                  0x00000006
#define _DMAINT0_LOWIF_MASK                      0x00000040
#define _DMAINT0_LOWIF_LENGTH                    0x00000001

#define _DMAINT0_HIGHIF_POSITION                 0x00000007
#define _DMAINT0_HIGHIF_MASK                     0x00000080
#define _DMAINT0_HIGHIF_LENGTH                   0x00000001

#define _DMAINT0_CHSEL_POSITION                  0x00000008
#define _DMAINT0_CHSEL_MASK                      0x00003F00
#define _DMAINT0_CHSEL_LENGTH                    0x00000006

#define _DMAINT0_DBUFWF_POSITION                 0x0000000F
#define _DMAINT0_DBUFWF_MASK                     0x00008000
#define _DMAINT0_DBUFWF_LENGTH                   0x00000001

#define _DMAINT0_CHSEL0_POSITION                 0x00000008
#define _DMAINT0_CHSEL0_MASK                     0x00000100
#define _DMAINT0_CHSEL0_LENGTH                   0x00000001

#define _DMAINT0_CHSEL1_POSITION                 0x00000009
#define _DMAINT0_CHSEL1_MASK                     0x00000200
#define _DMAINT0_CHSEL1_LENGTH                   0x00000001

#define _DMAINT0_CHSEL2_POSITION                 0x0000000A
#define _DMAINT0_CHSEL2_MASK                     0x00000400
#define _DMAINT0_CHSEL2_LENGTH                   0x00000001

