Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB202.h
#define _U1ADMD_ADMADDR5_POSITION                0x00000005
#define _U1ADMD_ADMADDR5_MASK                    0x00000020
#define _U1ADMD_ADMADDR5_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR6_POSITION                0x00000006
#define _U1ADMD_ADMADDR6_MASK                    0x00000040
#define _U1ADMD_ADMADDR6_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR7_POSITION                0x00000007
#define _U1ADMD_ADMADDR7_MASK                    0x00000080
#define _U1ADMD_ADMADDR7_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK0_POSITION                0x00000008
#define _U1ADMD_ADMMASK0_MASK                    0x00000100
#define _U1ADMD_ADMMASK0_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK1_POSITION                0x00000009
#define _U1ADMD_ADMMASK1_MASK                    0x00000200
#define _U1ADMD_ADMMASK1_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK2_POSITION                0x0000000A
#define _U1ADMD_ADMMASK2_MASK                    0x00000400
#define _U1ADMD_ADMMASK2_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK3_POSITION                0x0000000B
#define _U1ADMD_ADMMASK3_MASK                    0x00000800
#define _U1ADMD_ADMMASK3_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK4_POSITION                0x0000000C
#define _U1ADMD_ADMMASK4_MASK                    0x00001000
#define _U1ADMD_ADMMASK4_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK5_POSITION                0x0000000D
#define _U1ADMD_ADMMASK5_MASK                    0x00002000
#define _U1ADMD_ADMMASK5_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK6_POSITION                0x0000000E
#define _U1ADMD_ADMMASK6_MASK                    0x00004000
#define _U1ADMD_ADMMASK6_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK7_POSITION                0x0000000F
#define _U1ADMD_ADMMASK7_MASK                    0x00008000
#define _U1ADMD_ADMMASK7_LENGTH                  0x00000001

#define _U1SCCON_SCEN_POSITION                   0x00000000
#define _U1SCCON_SCEN_MASK                       0x00000001
#define _U1SCCON_SCEN_LENGTH                     0x00000001

#define _U1SCCON_PTRCL_POSITION                  0x00000001
#define _U1SCCON_PTRCL_MASK                      0x00000002
#define _U1SCCON_PTRCL_LENGTH                    0x00000001

#define _U1SCCON_T0PD_POSITION                   0x00000002
#define _U1SCCON_T0PD_MASK                       0x00000004
#define _U1SCCON_T0PD_LENGTH                     0x00000001

#define _U1SCCON_CONV_POSITION                   0x00000003
#define _U1SCCON_CONV_MASK                       0x00000008
#define _U1SCCON_CONV_LENGTH                     0x00000001

#define _U1SCCON_TXRPT_POSITION                  0x00000004
#define _U1SCCON_TXRPT_MASK                      0x00000030
#define _U1SCCON_TXRPT_LENGTH                    0x00000002

#define _U1SCCON_TXRPT0_POSITION                 0x00000004
#define _U1SCCON_TXRPT0_MASK                     0x00000010
#define _U1SCCON_TXRPT0_LENGTH                   0x00000001

#define _U1SCCON_TXRPT1_POSITION                 0x00000005
#define _U1SCCON_TXRPT1_MASK                     0x00000020
#define _U1SCCON_TXRPT1_LENGTH                   0x00000001

#define _U1SCINT_GTCIE_POSITION                  0x00000000
#define _U1SCINT_GTCIE_MASK                      0x00000001
#define _U1SCINT_GTCIE_LENGTH                    0x00000001

#define _U1SCINT_WTCIE_POSITION                  0x00000001
#define _U1SCINT_WTCIE_MASK                      0x00000002
#define _U1SCINT_WTCIE_LENGTH                    0x00000001

#define _U1SCINT_TXRPTIE_POSITION                0x00000004
#define _U1SCINT_TXRPTIE_MASK                    0x00000010
#define _U1SCINT_TXRPTIE_LENGTH                  0x00000001

#define _U1SCINT_RXRPTIE_POSITION                0x00000005
#define _U1SCINT_RXRPTIE_MASK                    0x00000020
#define _U1SCINT_RXRPTIE_LENGTH                  0x00000001

#define _U1SCINT_PARIE_POSITION                  0x00000006
#define _U1SCINT_PARIE_MASK                      0x00000040
#define _U1SCINT_PARIE_LENGTH                    0x00000001

#define _U1SCINT_GTCIF_POSITION                  0x00000008
#define _U1SCINT_GTCIF_MASK                      0x00000100
#define _U1SCINT_GTCIF_LENGTH                    0x00000001

#define _U1SCINT_WTCIF_POSITION                  0x00000009
#define _U1SCINT_WTCIF_MASK                      0x00000200
#define _U1SCINT_WTCIF_LENGTH                    0x00000001

#define _U1SCINT_TXRPTIF_POSITION                0x0000000C
#define _U1SCINT_TXRPTIF_MASK                    0x00001000
#define _U1SCINT_TXRPTIF_LENGTH                  0x00000001

#define _U1SCINT_RXRPTIF_POSITION                0x0000000D
#define _U1SCINT_RXRPTIF_MASK                    0x00002000
#define _U1SCINT_RXRPTIF_LENGTH                  0x00000001

#define _U1GTC_GTC_POSITION                      0x00000000
#define _U1GTC_GTC_MASK                          0x000001FF
#define _U1GTC_GTC_LENGTH                        0x00000009

#define _U1GTC_GTC0_POSITION                     0x00000000
#define _U1GTC_GTC0_MASK                         0x00000001
#define _U1GTC_GTC0_LENGTH                       0x00000001

#define _U1GTC_GTC1_POSITION                     0x00000001
#define _U1GTC_GTC1_MASK                         0x00000002
#define _U1GTC_GTC1_LENGTH                       0x00000001

#define _U1GTC_GTC2_POSITION                     0x00000002
#define _U1GTC_GTC2_MASK                         0x00000004
#define _U1GTC_GTC2_LENGTH                       0x00000001

#define _U1GTC_GTC3_POSITION                     0x00000003
#define _U1GTC_GTC3_MASK                         0x00000008
#define _U1GTC_GTC3_LENGTH                       0x00000001

#define _U1GTC_GTC4_POSITION                     0x00000004
#define _U1GTC_GTC4_MASK                         0x00000010
#define _U1GTC_GTC4_LENGTH                       0x00000001

#define _U1GTC_GTC5_POSITION                     0x00000005
#define _U1GTC_GTC5_MASK                         0x00000020
#define _U1GTC_GTC5_LENGTH                       0x00000001

#define _U1GTC_GTC6_POSITION                     0x00000006
#define _U1GTC_GTC6_MASK                         0x00000040
#define _U1GTC_GTC6_LENGTH                       0x00000001

#define _U1GTC_GTC7_POSITION                     0x00000007
#define _U1GTC_GTC7_MASK                         0x00000080
#define _U1GTC_GTC7_LENGTH                       0x00000001

